element/mirror_gateway_1/MIG1-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: MIG1-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: MIG1-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  MIG1-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(chrome://newtab/)
      - go(https://login.microsoftonline.com/common/oauth2/authorize?client_id=00000006-0000-0ff1-ce00-000000000000&response_mode=form_post&response_type=code+id_token&scope=openid+profile&state=OpenIdConnect.AuthenticationProperties%3dnd3M_pHFxXUzefkd4rxMY0azLnD4-cckAPzYtZzYks2LgruRGSek0fl83D5_pXcmHa5QGlL7MMpLccGl-ggoOATB4eAr56gBE25hClUxpLxyXNJWMEdS6R8rJs-zecHTAfBsNaey4mxTXNv_5Fg8LFsb7k1LUTzONQAzp11ixZ4&nonce=636966573522340443.ZTlhNWZiYmYtN2Y5Yy00MjBiLTg3MGQtNzA4NmE1Nzg0NzA4MjVkZWEwZmItNmYzMi00YmRhLTkyZTUtNGZhYWNiMzFiZjA1&redirect_uri=https%3a%2f%2fportal.office.com%2flanding&ui_locales=en-US&mkt=en-US&client-request-id=cddde515-cfd7-4c47-85fb-25d6fd319624)
      - clickByID(otherTileText)
      - typeByID(i0116): "mig-test@tryelasticarpedge.com"
      - typeByID(i0118): "WshV]L&9rHnQed&S"
      - clickByID(idSIButton9)
      - go(https://dev-731117.okta.com/app/elasticadev731117_o365migeoe_1/exkmnenb9ujCJ4sK6356/sso/saml?SAMLRequest=jZC9asMwFEb3PIXRLluWYzsSjkOgS6Bd2tKhi9HPTWKwZUdXLsnbV00JdOx4Pw6Hw21213FIvsBjP7ktyVNGdu2q2S%2Fh7F7hsgCGJBIOt2TxTk4Ke5ROjYAyGPm2f3mWPGVy9lOYzDSQ5OOhijNJDogLHBwG5UKcWC4oqyhn77mQZSlL8RmZpy3prKqFrkDQQmlG17YwVPPKUmuBqTJX%2FFgY0jZ3n%2F9PkUIEH2IJac8hzCizDNU40Fh6vaVjf6IwQQqDwtAbRXtnUjONdyYzCnXn5%2B7n8KCGMRMbu67ZsTaszteWb7ThUHBR1VZrUZe8C%2F72cPkZ7AmirMl%2Bc9sm%2B%2FvPdvUN&RelayState=cmVxPXVybjpmZWRlcmF0aW9uOk1pY3Jvc29mdE9ubGluZSxycnM9ZXN0c3JlZGlyZWN0JTNEMiUyNmVzdHNyZXF1ZXN0JTNEclFJSUFZVlN2MnNUWVFEdEpVMXNpei1LSURocGhlb2dYSEtYLTVFMlVQR1NKbW5LM2NVMmx5YmZMZUc4LS03eTlYNTg1M2RmMi1RV0o4R3hPRGdVSjhlNk9ZbF9Ra0VzRGdxQ2k2aUlremdWUkxEUnhjMDNQTjd3aHZkNDcyYVdMX0NWUmU0dlpIYkNMT2U2UEd2RGlmb0g1T0xjX0tYUEgxNjllOTFVSF95OF92WVhfM2p4a0xrMnBEUk9Lc1ZpakFtMWdnSjJYV1REZ28zRFltQkZEb3E4Rnd4enpEQmZHZVlnazRNUjItMGNaaEpaa0pkbFdTb0xVcWtraUp3b0NnWFRDSVo2ejBRZ0JGUXZBUW1NT1U3YnJpTFY4QVN0dVVIMVZCSDFzTTdycWNkTnRMYTk1WnU5LXA0WnRxZ2VnbFJESEFmQ3phRnEtR1BUNkZLOWFRNUJUMGRhMmtEbXRzS196MXhvS3p0MFdKb1FKaWlGUHpLekxpYmhJTVlKUGNpLVlkb3hqRnBPRFVjUnRHbGhZb01SUmJaRkVZN3VFQnhEUWhGTVZpSkgwQWJ4V21QVTc2YlE5UjJSakRUQVdha2FyWXFzYmZ2S25SUlFNd1YtVWxJOXNyUFo3RUNmYzRNbFlWVWF4SDA3WExPa2pXYWdsalV0Vm0yN0diQ2VoOXVLVVJXaFFpVFpxOVpMMHJBV2RFZXhPaHIzOWZXZVZuYzY4dVlTV1VfWUZOcHJodUpXRTkyQ1l6RWNHWDE5ZHlBMXZDVzFrZHd0LTd6YU5kSzJ2cUdrTWMtamtTay16LVpQaHdoeGRKUTlmNW9fUXM1Q1RMQ0xBdmd4ZXlWRUhrdGhRbTlUTW9hQmxVeXFraGc2M3BfMWpxZVpiOU5udVZ4bFptWnVfdHpsX01MVXlUVHpOSGY2Z2NHWFIxY19QVHRaZlhKRHVYOUx5RTBkNVlxdHJiTG9TOWp0cUNEdEZNdWdIWFYzYXlwWkpsNnJidTNVakY0TjNOTVVmNjl0NFJXcHd1X25tZjE4X251ZWVYaG02dVhzX3hfMEd3Miw%3D)
      - go(https://saml-proxy.mig-eoe.elastica-inc.com/saml/casb_rp_samlrealm/bcsamlpost/proxy/98d470f7c0714d28bc2e32967dbb9752_tryelasticarpedgecom)
      - go(https://isolate.mig-eoe.elastica-inc.com/embeddedurl/?url=https%3A%2F%2Flogin.microsoftonline.com%2Flogin.srf)
      - clickByCSS(input.fgid_236)
      - switchWindow(win_ser_1)
      - clickByCSS(span.fgid_590)
      - clickByCSS(i.fgid_25522)
      - clickByCSS(span.fgid_28952)
      - clickByID(fileInput)

  MIG1-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.100 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://portal.office.com/'
            method: GET
            label: 'https://portal.office.com/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
          - url: 'https://login.microsoftonline.com/common/GetCredentialType?mkt=en-US'
            method: POST
            label: 'https://login.microsoftonline.com/common/GetCredentialType?mkt=en-US'
            headers:
              hpgrequestid: 1f92e65f-abe4-44f8-9c26-417f3e330500
              Origin: 'https://login.microsoftonline.com'
              client-request-id: cddde515-cfd7-4c47-85fb-25d6fd319624
              canary: AQABAAAAAADCoMpjJXrxTq9VG9te-7FXXclUp4dgwZUfxAiOy53nVMljHrCIoXy4xFYr3ABgupUfj_fbzoj3Eg6vDArtxa4F6mqfRg1A-Edc8vzJf4C5AxKQHyA-LK1sHXa36u9bwB6vOzUJ2ai2jnWPwSJ7vGZz8vNAzHHzvvPaFsbvBoPZ56CpoDGNrc6p8kHiv0uxS4Mhnd2QRoWkqVRbDubUezOa19lOGZlC_o24lDx1D4JFxyAA
              Content-type: application/json; charset=UTF-8
              hpgid: '1104'
              Accept: application/json
              hpgact: '1800'
            body: '{"username":"mig-test@tryelasticarpedge.com","isOtherIdpSupported":true,"checkPhones":false,"isRemoteNGCSupported":true,"isCookieBannerShown":false,"isFidoSupported":false,"originalRequest":"rQIIAYWSv2sTUQDHe0kT2-KPIghuVqgOwiV3uR9pAxUuaZKm3F3a5mLybgnn5d3l9e7eO9-9tsktToJjcXAoTo51cxL_hIJYHBQENxVxEqeCCDa4uPkdvnyG7_CF7_dOViyIlWXhr1R-6rzgeSLvwin9I3p1YfHal09vPrxt6o9-3Xr_W3y6fMzdHDEWJ5ViMSaUOWGBeB5yYcElUTF08BBh_xXHnXLcN447yuQg5rud40yiSuqqqiplSSmVJFmQZalgW-HI7NkIRICZJaCAiSAYu1WkW75kNLeZmWqyGdVFM_WFKRu79wK7Vz-woxYzI5AaSBBAtDPSrWBiW11mNu0R6JnISBvI3tXEj5krbW2PjUpTIxSl8Gdm3iM0GsQkYUfZd1w7hrg1rBGMocsK0xjEDLkOQwRvURJDyhBM1vBQMgbxRmPc76bQC4YyHRtAcFIdr8u86wbaVgqYnYIgKek-3dtpdmAgeOGKtK4M4r4bbTjKdjPUy4YR667bDHnfJ23NqspQo4rqV-slZVQLu-NYH0_65mbPqA876s4K3Uz4FLobluZVE9OBEzkaW31zf6A0_BW9kdwvB6LetdK2ua2lsSiisS2_zObPh4gIPslePu-P0XAppsRDITyd5b7PXhRylbm5hcVL1_NLM2ez3PPc-cSDr09ufH5xtv7stvbwrpSbOckVW_fKcqAQr6ODtFMsgzbu7td0ukr9Vt3Zq1m9GnhgaMFB2yFrSkU8zHOH-fyPPPf4wszr-f8f5A81","country":"US","forceotclogin":false,"isExternalFederationDisallowed":false,"isRemoteConnectSupported":false,"flowToken":"AQABAAEAAADCoMpjJXrxTq9VG9te-7FX2ZHIx_gVkTskhryBIi-TI0twB3FhDcKx0pWhHOURBAoDtuRJ5aqA8CoCWOLCRtKwmFv8CCTkMREmXW5upDt3gNfpeRC0WjLLMastzXItFvGDPUUBGBYjGDjx5KQPvYy-Vcp_rcMoxaoGE6RqTwHOaOm4mrvREteCzC-RaAEXr5cYjUDUknGB6S34vSh7ArmLTcoPlHmSf8A6HDngfcMrGWf7TUW2rKmydYbJlgzvi7hl-2b6k05WBizk2Rprg8m9BAUNZ1oX8T8Phb0BPzEHXT-0g5z-KZ9ekqEU2K0vZcczcxxjKgV36ZfTTBZLcyDC1oftYitqwWNXBwKRLLKl0t7vrA5pgA-MMg7D8L_DVeY8j1a730rlWnj-CU5R6yqyIAA"}'
          - url: 'https://saml-proxy.mig-eoe.elastica-inc.com/saml/casb_rp_samlrealm/bcsamlpost/proxy/98d470f7c0714d28bc2e32967dbb9752_tryelasticarpedgecom'
            method: POST
            label: 'https://saml-proxy.mig-eoe.elastica-inc.com/saml/casb_rp_samlrealm/bcsamlpost/proxy/98d470f7c0714d28bc2e32967dbb9752_tryelasticarpedgecom'
            think-time: 2555ms
            headers:
              Origin: 'https://login.microsoftonline.com'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              RelayState: 'estsredirect=2&estsrequest=rQIIAYVSv2sTYQDtJU1siz-KIDhpheogXHKX-5E2UPGSJmnK3cU2lybfLeG8--7y9X5853df2-QWJ8GxODgUJ8e6OYl_QkEsDgqCi6iIkzgVRLDRxc03PN7whvd472aWL_CVRe4vZHbCLOe6PGvDifoH5OLc_KXPH169e91UH_y8_vYX_3jxkLk2pDROKsVijAm1ggJ2XWTDgo3DYmBFDoq8FwxzzDBfGeYgk4MR2-0cZhJZkJdlWSoLUqkkiJwoCgXTCIZ6z0QgBFQvAQmMOU7briLV8AStuUH1VBH1sM7rqcdNtLa95Zu9-p4ZtqgeglRDHAfCzaFq-GPT6FK9aQ5BT0da2kDmtsK_z1xoKzt0WJoQJiiFPzKzLibhIMYJPci-YdoxjFpODUcRtGlhYoMRRbZFEY7uEBxDQhFMViJH0AbxWmPU76bQ9R2RjDTAWakarYqsbfvKnRRQMwV-UlI9srPZ7ECfc4MlYVUaxH07XLOkjWagljUtVm27GbCeh9uKURWhQiTZq9ZL0rAWdEexOhr39fWeVnc68uYSWU_YFNprhuJWE92CYzEcGX19dyA1vCW1kdwt-7zaNdK2vqGkMc-jkSk-z-ZPhwhxdJQ9f5o_Qs5CTLCLAvgxeyVEHkthQm9TMoaBlUyqkhg63p_1jqeZb9NnuVxlZmZu_tzl_MLUyTTzNHf6gcGXR1c_PTtZfXJDuX9LyE0d5YqtrbLoS9jtqCDtFMugHXV3aypZJl6rbu3UjF4N3NMUf69t4RWpwu_nmf18_nueeXhm6uXs_x_0Gw2'
              SAMLRequest: PHNhbWxwOkF1dGhuUmVxdWVzdCBJRD0iX2RhNzliNmU5LTNhYjAtNGQzYy1iMjZkLWRkZTBhNTFhMmYzYyIgVmVyc2lvbj0iMi4wIiBJc3N1ZUluc3RhbnQ9IjIwMTktMDYtMjBUMTk6NTU6NTYuODQ1WiIgeG1sbnM6c2FtbHA9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDpwcm90b2NvbCI+PElzc3VlciB4bWxucz0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmFzc2VydGlvbiI+dXJuOmZlZGVyYXRpb246TWljcm9zb2Z0T25saW5lPC9Jc3N1ZXI+PHNhbWxwOk5hbWVJRFBvbGljeSBGb3JtYXQ9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDpuYW1laWQtZm9ybWF0OnBlcnNpc3RlbnQiLz48L3NhbWxwOkF1dGhuUmVxdWVzdD4=
              username: mig-test@tryelasticarpedge.com
          - url: 'https://dev-731117.okta.com/app/elasticadev731117_o365migeoe_1/exkmnenb9ujCJ4sK6356/sso/saml'
            method: GET
            label: 'https://dev-731117.okta.com/app/elasticadev731117_o365migeoe_1/exkmnenb9ujCJ4sK6356/sso/saml'
            think-time: 296ms
            headers:
              Origin: 'https://login.microsoftonline.com'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              SAMLRequest: jZC9asMwFEb3PIXRLluWYzsSjkOgS6Bd2tKhi9HPTWKwZUdXLsnbV00JdOx4Pw6Hw21213FIvsBjP7ktyVNGdu2q2S/h7F7hsgCGJBIOt2TxTk4Ke5ROjYAyGPm2f3mWPGVy9lOYzDSQ5OOhijNJDogLHBwG5UKcWC4oqyhn77mQZSlL8RmZpy3prKqFrkDQQmlG17YwVPPKUmuBqTJX/FgY0jZ3n/9PkUIEH2IJac8hzCizDNU40Fh6vaVjf6IwQQqDwtAbRXtnUjONdyYzCnXn5+7n8KCGMRMbu67ZsTaszteWb7ThUHBR1VZrUZe8C/72cPkZ7AmirMl+c9sm+/vPdvUN
              RelayState: cmVxPXVybjpmZWRlcmF0aW9uOk1pY3Jvc29mdE9ubGluZSxycnM9ZXN0c3JlZGlyZWN0JTNEMiUyNmVzdHNyZXF1ZXN0JTNEclFJSUFZVlN2MnNUWVFEdEpVMXNpei1LSURocGhlb2dYSEtYLTVFMlVQR1NKbW5LM2NVMmx5YmZMZUc4LS03eTlYNTg1M2RmMi1RV0o4R3hPRGdVSjhlNk9ZbF9Ra0VzRGdxQ2k2aUlremdWUkxEUnhjMDNQTjd3aHZkNDcyYVdMX0NWUmU0dlpIYkNMT2U2UEd2RGlmb0g1T0xjX0tYUEgxNjllOTFVSF95OF92WVhfM2p4a0xrMnBEUk9Lc1ZpakFtMWdnSjJYV1REZ28zRFltQkZEb3E4Rnd4enpEQmZHZVlnazRNUjItMGNaaEpaa0pkbFdTb0xVcWtraUp3b0NnWFRDSVo2ejBRZ0JGUXZBUW1NT1U3YnJpTFY4QVN0dVVIMVZCSDFzTTdycWNkTnRMYTk1WnU5LXA0WnRxZ2VnbFJESEFmQ3phRnEtR1BUNkZLOWFRNUJUMGRhMmtEbXRzS196MXhvS3p0MFdKb1FKaWlGUHpLekxpYmhJTVlKUGNpLVlkb3hqRnBPRFVjUnRHbGhZb01SUmJaRkVZN3VFQnhEUWhGTVZpSkgwQWJ4V21QVTc2YlE5UjJSakRUQVdha2FyWXFzYmZ2S25SUlFNd1YtVWxJOXNyUFo3RUNmYzRNbFlWVWF4SDA3WExPa2pXYWdsalV0Vm0yN0diQ2VoOXVLVVJXaFFpVFpxOVpMMHJBV2RFZXhPaHIzOWZXZVZuYzY4dVlTV1VfWUZOcHJodUpXRTkyQ1l6RWNHWDE5ZHlBMXZDVzFrZHd0LTd6YU5kSzJ2cUdrTWMtamtTay16LVpQaHdoeGRKUTlmNW9fUXM1Q1RMQ0xBdmd4ZXlWRUhrdGhRbTlUTW9hQmxVeXFraGc2M3BfMWpxZVpiOU5udVZ4bFptWnVfdHpsX01MVXlUVHpOSGY2Z2NHWFIxY19QVHRaZlhKRHVYOUx5RTBkNVlxdHJiTG9TOWp0cUNEdEZNdWdIWFYzYXlwWkpsNnJidTNVakY0TjNOTVVmNjl0NFJXcHd1X25tZjE4X251ZWVYaG02dVhzX3hfMEd3Miw=
          - url: 'https://saml-proxy.mig-eoe.elastica-inc.com/saml/casb_rp_samlrealm/bcsamlpost/proxy/98d470f7c0714d28bc2e32967dbb9752_tryelasticarpedgecom'
            method: POST
            label: 'https://saml-proxy.mig-eoe.elastica-inc.com/saml/casb_rp_samlrealm/bcsamlpost/proxy/98d470f7c0714d28bc2e32967dbb9752_tryelasticarpedgecom'
            think-time: 859ms
            headers:
              Origin: 'https://dev-731117.okta.com'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              RelayState: cmVxPXVybjpmZWRlcmF0aW9uOk1pY3Jvc29mdE9ubGluZSxycnM9ZXN0c3JlZGlyZWN0JTNEMiUyNmVzdHNyZXF1ZXN0JTNEclFJSUFZVlN2MnNUWVFEdEpVMXNpei1LSURocGhlb2dYSEtYLTVFMlVQR1NKbW5LM2NVMmx5YmZMZUc4LS03eTlYNTg1M2RmMi1RV0o4R3hPRGdVSjhlNk9ZbF9Ra0VzRGdxQ2k2aUlremdWUkxEUnhjMDNQTjd3aHZkNDcyYVdMX0NWUmU0dlpIYkNMT2U2UEd2RGlmb0g1T0xjX0tYUEgxNjllOTFVSF95OF92WVhfM2p4a0xrMnBEUk9Lc1ZpakFtMWdnSjJYV1REZ28zRFltQkZEb3E4Rnd4enpEQmZHZVlnazRNUjItMGNaaEpaa0pkbFdTb0xVcWtraUp3b0NnWFRDSVo2ejBRZ0JGUXZBUW1NT1U3YnJpTFY4QVN0dVVIMVZCSDFzTTdycWNkTnRMYTk1WnU5LXA0WnRxZ2VnbFJESEFmQ3phRnEtR1BUNkZLOWFRNUJUMGRhMmtEbXRzS196MXhvS3p0MFdKb1FKaWlGUHpLekxpYmhJTVlKUGNpLVlkb3hqRnBPRFVjUnRHbGhZb01SUmJaRkVZN3VFQnhEUWhGTVZpSkgwQWJ4V21QVTc2YlE5UjJSakRUQVdha2FyWXFzYmZ2S25SUlFNd1YtVWxJOXNyUFo3RUNmYzRNbFlWVWF4SDA3WExPa2pXYWdsalV0Vm0yN0diQ2VoOXVLVVJXaFFpVFpxOVpMMHJBV2RFZXhPaHIzOWZXZVZuYzY4dVlTV1VfWUZOcHJodUpXRTkyQ1l6RWNHWDE5ZHlBMXZDVzFrZHd0LTd6YU5kSzJ2cUdrTWMtamtTay16LVpQaHdoeGRKUTlmNW9fUXM1Q1RMQ0xBdmd4ZXlWRUhrdGhRbTlUTW9hQmxVeXFraGc2M3BfMWpxZVpiOU5udVZ4bFptWnVfdHpsX01MVXlUVHpOSGY2Z2NHWFIxY19QVHRaZlhKRHVYOUx5RTBkNVlxdHJiTG9TOWp0cUNEdEZNdWdIWFYzYXlwWkpsNnJidTNVakY0TjNOTVVmNjl0NFJXcHd1X25tZjE4X251ZWVYaG02dVhzX3hfMEd3Miw=
              SAMLResponse: PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz48c2FtbDJwOlJlc3BvbnNlIHhtbG5zOnNhbWwycD0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOnByb3RvY29sIiBEZXN0aW5hdGlvbj0iaHR0cHM6Ly9zYW1sLXByb3h5Lm1pZy1lb2UuZWxhc3RpY2EtaW5jLmNvbS9zYW1sL2Nhc2JfcnBfc2FtbHJlYWxtL2Jjc2FtbHBvc3QvcHJveHkvOThkNDcwZjdjMDcxNGQyOGJjMmUzMjk2N2RiYjk3NTJfdHJ5ZWxhc3RpY2FycGVkZ2Vjb20iIElEPSJpZDc4NDAxOTI2NzYxMDU0NzE1NTk4ODA0MTEiIEluUmVzcG9uc2VUbz0iX2RhNzliNmU5LTNhYjAtNGQzYy1iMjZkLWRkZTBhNTFhMmYzYyIgSXNzdWVJbnN0YW50PSIyMDE5LTA2LTIwVDE5OjU2OjAwLjA3OFoiIFZlcnNpb249IjIuMCIgeG1sbnM6eHM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1MU2NoZW1hIj48c2FtbDI6SXNzdWVyIHhtbG5zOnNhbWwyPSJ1cm46b2FzaXM6bmFtZXM6dGM6U0FNTDoyLjA6YXNzZXJ0aW9uIiBGb3JtYXQ9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDpuYW1laWQtZm9ybWF0OmVudGl0eSI+aHR0cDovL3d3dy5va3RhLmNvbS9leGttbmVuYjl1akNKNHNLNjM1Njwvc2FtbDI6SXNzdWVyPjxkczpTaWduYXR1cmUgeG1sbnM6ZHM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvMDkveG1sZHNpZyMiPjxkczpTaWduZWRJbmZvPjxkczpDYW5vbmljYWxpemF0aW9uTWV0aG9kIEFsZ29yaXRobT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS8xMC94bWwtZXhjLWMxNG4jIi8+PGRzOlNpZ25hdHVyZU1ldGhvZCBBbGdvcml0aG09Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvMDQveG1sZHNpZy1tb3JlI3JzYS1zaGEyNTYiLz48ZHM6UmVmZXJlbmNlIFVSST0iI2lkNzg0MDE5MjY3NjEwNTQ3MTU1OTg4MDQxMSI+PGRzOlRyYW5zZm9ybXM+PGRzOlRyYW5zZm9ybSBBbGdvcml0aG09Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvMDkveG1sZHNpZyNlbnZlbG9wZWQtc2lnbmF0dXJlIi8+PGRzOlRyYW5zZm9ybSBBbGdvcml0aG09Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvMTAveG1sLWV4Yy1jMTRuIyI+PGVjOkluY2x1c2l2ZU5hbWVzcGFjZXMgeG1sbnM6ZWM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvMTAveG1sLWV4Yy1jMTRuIyIgUHJlZml4TGlzdD0ieHMiLz48L2RzOlRyYW5zZm9ybT48L2RzOlRyYW5zZm9ybXM+PGRzOkRpZ2VzdE1ldGhvZCBBbGdvcml0aG09Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvMDQveG1sZW5jI3NoYTI1NiIvPjxkczpEaWdlc3RWYWx1ZT56a2ZWNjZLNUozQnNGbUpFSVdjNjJpSFJadndjT0dlUHJWWjArdThiVnRZPTwvZHM6RGlnZXN0VmFsdWU+PC9kczpSZWZlcmVuY2U+PC9kczpTaWduZWRJbmZvPjxkczpTaWduYXR1cmVWYWx1ZT5ubThFdFYzU24yakhVZ2c2T0Y1N3N0bHFwak10NnVjMHNuaW44OXhBenJKNElZQlp4cUNzcG1UMmhvS0VvUXZqeDhySTN6Q0pVd3lYVy85RllaV3hjakhBQWIrU2kzRWt2ZkRqUzF3RGZ3RFg2a2FURFBIMW90ZnBUVytJTzNGNlJqTElyczYvZmZUT1VneTVuQ1dnUGMxejJKTDRRRzhZc2RHMGNKY2lTRjZTNzdnK3lieE5UT3I2NDRQV3FpeS9YVklhc2F6R3U0N1hUREllZnhyNEJXdlRqSDlkd29kMWp3UzBjeFdOTW5GbW1JT211Tm4rVjA1b3NpcFN3ZWR0eVl2dFlpL0JnWDlGRUdIVW9mbXpvTkFSREhzQkxTcWNwTlY3UFloTFUrWlJ0cWpEdy90YXRKMG1FNVV4ZXdUQm5QT3lhTk5PeDZQM0dXczZkeUFyOHc9PTwvZHM6U2lnbmF0dXJlVmFsdWU+PGRzOktleUluZm8+PGRzOlg1MDlEYXRhPjxkczpYNTA5Q2VydGlmaWNhdGU+TUlJRHBEQ0NBb3lnQXdJQkFnSUdBV3BhdTZtdk1BMEdDU3FHU0liM0RRRUJDd1VBTUlHU01Rc3dDUVlEVlFRR0V3SlZVekVUTUJFRwpBMVVFQ0F3S1EyRnNhV1p2Y201cFlURVdNQlFHQTFVRUJ3d05VMkZ1SUVaeVlXNWphWE5qYnpFTk1Bc0dBMVVFQ2d3RVQydDBZVEVVCk1CSUdBMVVFQ3d3TFUxTlBVSEp2ZG1sa1pYSXhFekFSQmdOVkJBTU1DbVJsZGkwM016RXhNVGN4SERBYUJna3Foa2lHOXcwQkNRRVcKRFdsdVptOUFiMnQwWVM1amIyMHdIaGNOTVRrd05ESTJNVGN6T1RBNVdoY05Namt3TkRJMk1UYzBNREE1V2pDQmtqRUxNQWtHQTFVRQpCaE1DVlZNeEV6QVJCZ05WQkFnTUNrTmhiR2xtYjNKdWFXRXhGakFVQmdOVkJBY01EVk5oYmlCR2NtRnVZMmx6WTI4eERUQUxCZ05WCkJBb01CRTlyZEdFeEZEQVNCZ05WQkFzTUMxTlRUMUJ5YjNacFpHVnlNUk13RVFZRFZRUUREQXBrWlhZdE56TXhNVEUzTVJ3d0dnWUoKS29aSWh2Y05BUWtCRmcxcGJtWnZRRzlyZEdFdVkyOXRNSUlCSWpBTkJna3Foa2lHOXcwQkFRRUZBQU9DQVE4QU1JSUJDZ0tDQVFFQQpwVUJDdVpHRms0N05VU2h6aGxtYlF0d1gvTnpWSnJoNEYzcTRtVWR2a3lVS3Nqb1BEbHdpZmR2OEdZelpvQjJWQjEzQnpoOTljS25NCkI3Um9MaG1ZbEJPWnkwbEw4OGd1eGRqVlBocWlyaVFZK3g5amxTaWd1R0NSdjVuZ05UalplSDF2QzRWRHlVb1ZpZ2tySVNUSnhmY1oKcXl1VGcwQ0lOdmpxM2RaQmc4bFJNSmhYbjJ6V1BSLzh4U0c3dEVaN0VjS3p4ZkZlaFl6WWZBYVYyZTdCMXRqbmV3RFVuOXZ1alcwYQpTU0xZVVJQdFdvcmEzOFYrbENjWEZhbUJ3N2drZ1NsTFVMTnFMMmRlNHJuVGxERzZxK3FqME1kYkhnUDdNdjFpOGxpa0FlbFpqbWtvCjdJQlBaeHVjdzJkb1dmVWJHbnZrM2dNWkhURkJZOGg0V0N5QUFRSURBUUFCTUEwR0NTcUdTSWIzRFFFQkN3VUFBNElCQVFCbnJwcUUKNUNMeVZGUU9WQlNuQngzcHpycEVMUExDS1c2THVqcTdsak1vcmszV3l6SlBJcFJMejc4QTRvQW9yY29tanBndG9PYzlFTXloWndUSgpGckk1ajN5UkFXbFozSU1nN2JkdmhKeFB3OW0vc3dlZzdSSkd1eG1XZ2d2MGdrVVJUVi9mVlA1U2J1SEVTWlF3SmN6dkNyVHJ3KzlQCjY3Uk5jQkhNb2ttdkk2bGhwNG9zb085bkhtb1dIMFNuRUY1QXd3anZ6Z09rZ1poOTR4YWkxWnY0Y1VzamVNQlNNSW5iS1RXNHRhY0sKWTVWelc5OEF4VGFLckhVTHJsc2NidFA3QnpROUsyeWdVV1FQcFkyWlVMZ0l2RkVTQ21YeWU3SEVGRlQzNkVtMW5weit5L201MklqKwpFRXdqUE1Wb3BRQTFnVjIwOW8xSi8vamdjcHFmVEh6VjwvZHM6WDUwOUNlcnRpZmljYXRlPjwvZHM6WDUwOURhdGE+PC9kczpLZXlJbmZvPjwvZHM6U2lnbmF0dXJlPjxzYW1sMnA6U3RhdHVzIHhtbG5zOnNhbWwycD0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOnByb3RvY29sIj48c2FtbDJwOlN0YXR1c0NvZGUgVmFsdWU9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDpzdGF0dXM6U3VjY2VzcyIvPjwvc2FtbDJwOlN0YXR1cz48c2FtbDI6QXNzZXJ0aW9uIHhtbG5zOnNhbWwyPSJ1cm46b2FzaXM6bmFtZXM6dGM6U0FNTDoyLjA6YXNzZXJ0aW9uIiBJRD0iaWQ3ODQwMTkyNjc2MjAzODg3MjA1NDA5NjgyNSIgSXNzdWVJbnN0YW50PSIyMDE5LTA2LTIwVDE5OjU2OjAwLjA3OFoiIFZlcnNpb249IjIuMCIgeG1sbnM6eHM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1MU2NoZW1hIj48c2FtbDI6SXNzdWVyIEZvcm1hdD0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOm5hbWVpZC1mb3JtYXQ6ZW50aXR5IiB4bWxuczpzYW1sMj0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmFzc2VydGlvbiI+aHR0cDovL3d3dy5va3RhLmNvbS9leGttbmVuYjl1akNKNHNLNjM1Njwvc2FtbDI6SXNzdWVyPjxkczpTaWduYXR1cmUgeG1sbnM6ZHM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvMDkveG1sZHNpZyMiPjxkczpTaWduZWRJbmZvPjxkczpDYW5vbmljYWxpemF0aW9uTWV0aG9kIEFsZ29yaXRobT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS8xMC94bWwtZXhjLWMxNG4jIi8+PGRzOlNpZ25hdHVyZU1ldGhvZCBBbGdvcml0aG09Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvMDQveG1sZHNpZy1tb3JlI3JzYS1zaGEyNTYiLz48ZHM6UmVmZXJlbmNlIFVSST0iI2lkNzg0MDE5MjY3NjIwMzg4NzIwNTQwOTY4MjUiPjxkczpUcmFuc2Zvcm1zPjxkczpUcmFuc2Zvcm0gQWxnb3JpdGhtPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwLzA5L3htbGRzaWcjZW52ZWxvcGVkLXNpZ25hdHVyZSIvPjxkczpUcmFuc2Zvcm0gQWxnb3JpdGhtPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxLzEwL3htbC1leGMtYzE0biMiPjxlYzpJbmNsdXNpdmVOYW1lc3BhY2VzIHhtbG5zOmVjPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxLzEwL3htbC1leGMtYzE0biMiIFByZWZpeExpc3Q9InhzIi8+PC9kczpUcmFuc2Zvcm0+PC9kczpUcmFuc2Zvcm1zPjxkczpEaWdlc3RNZXRob2QgQWxnb3JpdGhtPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxLzA0L3htbGVuYyNzaGEyNTYiLz48ZHM6RGlnZXN0VmFsdWU+Y3FoWnQ3SWUzVUl6NUQ0cHVMUHJmVXZOZ1hrZ2VoUzRCUC9HTXdJNWwybz08L2RzOkRpZ2VzdFZhbHVlPjwvZHM6UmVmZXJlbmNlPjwvZHM6U2lnbmVkSW5mbz48ZHM6U2lnbmF0dXJlVmFsdWU+UnRDbXdMQk9QUVJWaGNNc2ErOWp3SkFQSXRhL0U5WndFOUduQlEzbUhZOVlqMGhwT0E3S2tGdi91aHpBak8vVWdKemwzSXJPVGNPbnk4bFVmNFQ0VG9qcVNRVkhZWGRNOU4wbTZVeklEYlZ2K2hESjljcWx0a29KM3VRVGd3R1NNMkROWVJ3bWtrR2hBV3dCN0FZdTJIUTJIYzU0RzRDamlWc3lRcFgzMHNGT1dVTFE3OEx6U3pwaWtROWdJcno1WE9XQnQyLzJuQU5XNmp4MTdWamw0d1JPa1ZMTzFNcVR0SDFDOFBQck5GNDBEdkRHb2Y5dVhaemVJMFl6bnhIVEVROXJXZld6bTl1a0tIWTdHYWgxNmlpREsxRFNuRlpGWlFQd05ySVZNdTJ0Q1BXOFpvR2hnZXJaTUg5SUJxbDJkRkxwQ3p2RTJwL3lhSUtMUVM4ODhRPT08L2RzOlNpZ25hdHVyZVZhbHVlPjxkczpLZXlJbmZvPjxkczpYNTA5RGF0YT48ZHM6WDUwOUNlcnRpZmljYXRlPk1JSURwRENDQW95Z0F3SUJBZ0lHQVdwYXU2bXZNQTBHQ1NxR1NJYjNEUUVCQ3dVQU1JR1NNUXN3Q1FZRFZRUUdFd0pWVXpFVE1CRUcKQTFVRUNBd0tRMkZzYVdadmNtNXBZVEVXTUJRR0ExVUVCd3dOVTJGdUlFWnlZVzVqYVhOamJ6RU5NQXNHQTFVRUNnd0VUMnQwWVRFVQpNQklHQTFVRUN3d0xVMU5QVUhKdmRtbGtaWEl4RXpBUkJnTlZCQU1NQ21SbGRpMDNNekV4TVRjeEhEQWFCZ2txaGtpRzl3MEJDUUVXCkRXbHVabTlBYjJ0MFlTNWpiMjB3SGhjTk1Ua3dOREkyTVRjek9UQTVXaGNOTWprd05ESTJNVGMwTURBNVdqQ0JrakVMTUFrR0ExVUUKQmhNQ1ZWTXhFekFSQmdOVkJBZ01Da05oYkdsbWIzSnVhV0V4RmpBVUJnTlZCQWNNRFZOaGJpQkdjbUZ1WTJselkyOHhEVEFMQmdOVgpCQW9NQkU5cmRHRXhGREFTQmdOVkJBc01DMU5UVDFCeWIzWnBaR1Z5TVJNd0VRWURWUVFEREFwa1pYWXROek14TVRFM01Sd3dHZ1lKCktvWklodmNOQVFrQkZnMXBibVp2UUc5cmRHRXVZMjl0TUlJQklqQU5CZ2txaGtpRzl3MEJBUUVGQUFPQ0FROEFNSUlCQ2dLQ0FRRUEKcFVCQ3VaR0ZrNDdOVVNoemhsbWJRdHdYL056VkpyaDRGM3E0bVVkdmt5VUtzam9QRGx3aWZkdjhHWXpab0IyVkIxM0J6aDk5Y0tuTQpCN1JvTGhtWWxCT1p5MGxMODhndXhkalZQaHFpcmlRWSt4OWpsU2lndUdDUnY1bmdOVGpaZUgxdkM0VkR5VW9WaWdrcklTVEp4ZmNaCnF5dVRnMENJTnZqcTNkWkJnOGxSTUpoWG4yeldQUi84eFNHN3RFWjdFY0t6eGZGZWhZellmQWFWMmU3QjF0am5ld0RVbjl2dWpXMGEKU1NMWVVSUHRXb3JhMzhWK2xDY1hGYW1Cdzdna2dTbExVTE5xTDJkZTRyblRsREc2cStxajBNZGJIZ1A3TXYxaThsaWtBZWxaam1rbwo3SUJQWnh1Y3cyZG9XZlViR252azNnTVpIVEZCWThoNFdDeUFBUUlEQVFBQk1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQm5ycHFFCjVDTHlWRlFPVkJTbkJ4M3B6cnBFTFBMQ0tXNkx1anE3bGpNb3JrM1d5ekpQSXBSTHo3OEE0b0FvcmNvbWpwZ3RvT2M5RU15aFp3VEoKRnJJNWozeVJBV2xaM0lNZzdiZHZoSnhQdzltL3N3ZWc3UkpHdXhtV2dndjBna1VSVFYvZlZQNVNidUhFU1pRd0pjenZDclRydys5UAo2N1JOY0JITW9rbXZJNmxocDRvc29POW5IbW9XSDBTbkVGNUF3d2p2emdPa2daaDk0eGFpMVp2NGNVc2plTUJTTUluYktUVzR0YWNLClk1VnpXOThBeFRhS3JIVUxybHNjYnRQN0J6UTlLMnlnVVdRUHBZMlpVTGdJdkZFU0NtWHllN0hFRkZUMzZFbTFucHoreS9tNTJJaisKRUV3alBNVm9wUUExZ1YyMDlvMUovL2pnY3BxZlRIelY8L2RzOlg1MDlDZXJ0aWZpY2F0ZT48L2RzOlg1MDlEYXRhPjwvZHM6S2V5SW5mbz48L2RzOlNpZ25hdHVyZT48c2FtbDI6U3ViamVjdCB4bWxuczpzYW1sMj0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmFzc2VydGlvbiI+PHNhbWwyOk5hbWVJRCBGb3JtYXQ9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjEuMTpuYW1laWQtZm9ybWF0OnVuc3BlY2lmaWVkIj5taWctdGVzdEB0cnllbGFzdGljYXJwZWRnZS5jb208L3NhbWwyOk5hbWVJRD48c2FtbDI6U3ViamVjdENvbmZpcm1hdGlvbiBNZXRob2Q9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDpjbTpiZWFyZXIiPjxzYW1sMjpTdWJqZWN0Q29uZmlybWF0aW9uRGF0YSBJblJlc3BvbnNlVG89Il9kYTc5YjZlOS0zYWIwLTRkM2MtYjI2ZC1kZGUwYTUxYTJmM2MiIE5vdE9uT3JBZnRlcj0iMjAxOS0wNi0yMFQyMDowMTowMC4wNzlaIiBSZWNpcGllbnQ9Imh0dHBzOi8vc2FtbC1wcm94eS5taWctZW9lLmVsYXN0aWNhLWluYy5jb20vc2FtbC9jYXNiX3JwX3NhbWxyZWFsbS9iY3NhbWxwb3N0L3Byb3h5Lzk4ZDQ3MGY3YzA3MTRkMjhiYzJlMzI5NjdkYmI5NzUyX3RyeWVsYXN0aWNhcnBlZGdlY29tIi8+PC9zYW1sMjpTdWJqZWN0Q29uZmlybWF0aW9uPjwvc2FtbDI6U3ViamVjdD48c2FtbDI6Q29uZGl0aW9ucyBOb3RCZWZvcmU9IjIwMTktMDYtMjBUMTk6NTE6MDAuMDc5WiIgTm90T25PckFmdGVyPSIyMDE5LTA2LTIwVDIwOjAxOjAwLjA3OVoiIHhtbG5zOnNhbWwyPSJ1cm46b2FzaXM6bmFtZXM6dGM6U0FNTDoyLjA6YXNzZXJ0aW9uIj48c2FtbDI6QXVkaWVuY2VSZXN0cmljdGlvbj48c2FtbDI6QXVkaWVuY2U+aHR0cHM6Ly9zYW1sLXByb3h5Lm1pZy1lb2UuZWxhc3RpY2EtaW5jLmNvbS9zYW1sL2Nhc2JfcnBfc2FtbHJlYWxtLzk4ZDQ3MGY3YzA3MTRkMjhiYzJlMzI5NjdkYmI5NzUyX3RyeWVsYXN0aWNhcnBlZGdlY29tPC9zYW1sMjpBdWRpZW5jZT48L3NhbWwyOkF1ZGllbmNlUmVzdHJpY3Rpb24+PC9zYW1sMjpDb25kaXRpb25zPjxzYW1sMjpBdXRoblN0YXRlbWVudCBBdXRobkluc3RhbnQ9IjIwMTktMDYtMjBUMTk6NTY6MDAuMDc4WiIgU2Vzc2lvbkluZGV4PSJfZGE3OWI2ZTktM2FiMC00ZDNjLWIyNmQtZGRlMGE1MWEyZjNjIiB4bWxuczpzYW1sMj0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmFzc2VydGlvbiI+PHNhbWwyOkF1dGhuQ29udGV4dD48c2FtbDI6QXV0aG5Db250ZXh0Q2xhc3NSZWY+dXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmFjOmNsYXNzZXM6UGFzc3dvcmRQcm90ZWN0ZWRUcmFuc3BvcnQ8L3NhbWwyOkF1dGhuQ29udGV4dENsYXNzUmVmPjwvc2FtbDI6QXV0aG5Db250ZXh0Pjwvc2FtbDI6QXV0aG5TdGF0ZW1lbnQ+PHNhbWwyOkF0dHJpYnV0ZVN0YXRlbWVudCB4bWxuczpzYW1sMj0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmFzc2VydGlvbiI+PHNhbWwyOkF0dHJpYnV0ZSBOYW1lPSJvZmZpY2UzNjUtbmFtZUlEIiBOYW1lRm9ybWF0PSJ1cm46b2FzaXM6bmFtZXM6dGM6U0FNTDoyLjA6YXR0cm5hbWUtZm9ybWF0OnVuc3BlY2lmaWVkIj48c2FtbDI6QXR0cmlidXRlVmFsdWUgeG1sbnM6eHM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1MU2NoZW1hIiB4bWxuczp4c2k9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1MU2NoZW1hLWluc3RhbmNlIiB4c2k6dHlwZT0ieHM6c3RyaW5nIj5QN1IvaS91YmcwMmlDQ3o2amtpSC93PT08L3NhbWwyOkF0dHJpYnV0ZVZhbHVlPjwvc2FtbDI6QXR0cmlidXRlPjwvc2FtbDI6QXR0cmlidXRlU3RhdGVtZW50Pjwvc2FtbDI6QXNzZXJ0aW9uPjwvc2FtbDJwOlJlc3BvbnNlPg==
          - url: 'https://loginmicrosoftonlinecom.mig-eoe.elastica-inc.com/login.srf'
            method: POST
            label: 'https://loginmicrosoftonlinecom.mig-eoe.elastica-inc.com/login.srf'
            think-time: 388ms
            headers:
              Origin: 'https://saml-proxy.mig-eoe.elastica-inc.com'
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              RelayState: 'estsredirect%3D2%26estsrequest%3DrQIIAYVSv2sTYQDtJU1siz-KIDhpheogXHKX-5E2UPGSJmnK3cU2lybfLeG8--7y9X5853df2-QWJ8GxODgUJ8e6OYl_QkEsDgqCi6iIkzgVRLDRxc03PN7whvd472aWL_CVRe4vZHbCLOe6PGvDifoH5OLc_KXPH169e91UH_y8_vYX_3jxkLk2pDROKsVijAm1ggJ2XWTDgo3DYmBFDoq8FwxzzDBfGeYgk4MR2-0cZhJZkJdlWSoLUqkkiJwoCgXTCIZ6z0QgBFQvAQmMOU7briLV8AStuUH1VBH1sM7rqcdNtLa95Zu9-p4ZtqgeglRDHAfCzaFq-GPT6FK9aQ5BT0da2kDmtsK_z1xoKzt0WJoQJiiFPzKzLibhIMYJPci-YdoxjFpODUcRtGlhYoMRRbZFEY7uEBxDQhFMViJH0AbxWmPU76bQ9R2RjDTAWakarYqsbfvKnRRQMwV-UlI9srPZ7ECfc4MlYVUaxH07XLOkjWagljUtVm27GbCeh9uKURWhQiTZq9ZL0rAWdEexOhr39fWeVnc68uYSWU_YFNprhuJWE92CYzEcGX19dyA1vCW1kdwt-7zaNdK2vqGkMc-jkSk-z-ZPhwhxdJQ9f5o_Qs5CTLCLAvgxeyVEHkthQm9TMoaBlUyqkhg63p_1jqeZb9NnuVxlZmZu_tzl_MLUyTTzNHf6gcGXR1c_PTtZfXJDuX9LyE0d5YqtrbLoS9jtqCDtFMugHXV3aypZJl6rbu3UjF4N3NMUf69t4RWpwu_nmf18_nueeXhm6uXs_x_0Gw2'
              SAMLResponse: PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPHNhbWwycDpSZXNwb25zZSB4bWxuczpzYW1sMnA9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDpwcm90b2NvbCIgeG1sbnM6eHM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvWE1MU2NoZW1hIiBJRD0iaWQ3ODQwMTkyNjc2MTA1NDcxNTU5ODgwNDExIiBJblJlc3BvbnNlVG89Il9kYTc5YjZlOS0zYWIwLTRkM2MtYjI2ZC1kZGUwYTUxYTJmM2MiIElzc3VlSW5zdGFudD0iMjAxOS0wNi0yMFQxOTo1NjowMC4wNzhaIiBWZXJzaW9uPSIyLjAiIERlc3RpbmF0aW9uPSJodHRwczovL2xvZ2luLm1pY3Jvc29mdG9ubGluZS5jb20vbG9naW4uc3JmIj48c2FtbDI6SXNzdWVyIHhtbG5zOnNhbWwyPSJ1cm46b2FzaXM6bmFtZXM6dGM6U0FNTDoyLjA6YXNzZXJ0aW9uIiBGb3JtYXQ9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDpuYW1laWQtZm9ybWF0OmVudGl0eSI+aHR0cHM6Ly9zYW1sLXByb3h5Lm1pZy1lb2UuZWxhc3RpY2EtaW5jLmNvbS9zYW1sL2Nhc2JfcnBfc2FtbHJlYWxtLzk4ZDQ3MGY3YzA3MTRkMjhiYzJlMzI5NjdkYmI5NzUyX3RyeWVsYXN0aWNhcnBlZGdlY29tPC9zYW1sMjpJc3N1ZXI+PHNhbWwycDpTdGF0dXMgeG1sbnM6c2FtbDJwPSJ1cm46b2FzaXM6bmFtZXM6dGM6U0FNTDoyLjA6cHJvdG9jb2wiPjxzYW1sMnA6U3RhdHVzQ29kZSBWYWx1ZT0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOnN0YXR1czpTdWNjZXNzIi8+PC9zYW1sMnA6U3RhdHVzPjxzYW1sMjpBc3NlcnRpb24geG1sbnM6c2FtbDI9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDphc3NlcnRpb24iIHhtbG5zOnhzPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxL1hNTFNjaGVtYSIgSUQ9ImlkNzg0MDE5MjY3NjIwMzg4NzIwNTQwOTY4MjUiIElzc3VlSW5zdGFudD0iMjAxOS0wNi0yMFQxOTo1NjowMC4wNzhaIiBWZXJzaW9uPSIyLjAiPjxzYW1sMjpJc3N1ZXIgeG1sbnM6c2FtbDI9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDphc3NlcnRpb24iIEZvcm1hdD0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOm5hbWVpZC1mb3JtYXQ6ZW50aXR5Ij5odHRwczovL3NhbWwtcHJveHkubWlnLWVvZS5lbGFzdGljYS1pbmMuY29tL3NhbWwvY2FzYl9ycF9zYW1scmVhbG0vOThkNDcwZjdjMDcxNGQyOGJjMmUzMjk2N2RiYjk3NTJfdHJ5ZWxhc3RpY2FycGVkZ2Vjb208L3NhbWwyOklzc3Vlcj48U2lnbmF0dXJlIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwLzA5L3htbGRzaWcjIj4KPFNpZ25lZEluZm8+CjxDYW5vbmljYWxpemF0aW9uTWV0aG9kIEFsZ29yaXRobT0iaHR0cDovL3d3dy53My5vcmcvMjAwMS8xMC94bWwtZXhjLWMxNG4jIi8+CjxTaWduYXR1cmVNZXRob2QgQWxnb3JpdGhtPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxLzA0L3htbGRzaWctbW9yZSNyc2Etc2hhMjU2Ii8+CjxSZWZlcmVuY2UgVVJJPSIjaWQ3ODQwMTkyNjc2MjAzODg3MjA1NDA5NjgyNSI+CjxUcmFuc2Zvcm1zPgo8VHJhbnNmb3JtIEFsZ29yaXRobT0iaHR0cDovL3d3dy53My5vcmcvMjAwMC8wOS94bWxkc2lnI2VudmVsb3BlZC1zaWduYXR1cmUiLz4KPFRyYW5zZm9ybSBBbGdvcml0aG09Imh0dHA6Ly93d3cudzMub3JnLzIwMDEvMTAveG1sLWV4Yy1jMTRuIyIvPgo8L1RyYW5zZm9ybXM+CjxEaWdlc3RNZXRob2QgQWxnb3JpdGhtPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxLzA0L3htbGVuYyNzaGEyNTYiLz4KPERpZ2VzdFZhbHVlPlEyRVo0QmV1Z3k2NklVTW5xaGkrc3JIY1JKSjB6T3FmMnAyY0I0MjR2bFk9PC9EaWdlc3RWYWx1ZT4KPC9SZWZlcmVuY2U+CjwvU2lnbmVkSW5mbz4KPFNpZ25hdHVyZVZhbHVlPms0OGtBNEdHdTl1ODN2cHNELytLTmRQKzl6MGVqZU5vSms0TW5laVpFTU1HR1J4VWVKT3JYSUdXc1NMMkV5aGwKTGJIMTY0aHBwS1RHeU0xNU01citYQlNEZkdLZDBQK1dIYTkzdWR2Y2d4RHFDamNtdGdtNG1lVWdIWSs1YWtkbwphekFpZm4wQTJPa01oZHhrUzJ2UlZaalJBTTZzdGt3eG5OUEFkSXpaTCtFRVRZVEpPZVpNQ3oxelhTeENxeWtFCnFHVmFJTWNXbU55MGE0MnNDbE9IL004NHN3MGNFTHFTck1FampMYTFGWXZUWEprMnJhdUFoWkE3VjFZVG1mOVoKblAxQVNLVVRXVXMyMmtpdTR5WFdFcU9pMmJqbDlGaHhHUktyR1p5OGI4V3ljcStUWnBXWE5xcEM2OTNNL0t0RQo4S3N2UFdCUTM0dUU3a3pDRytnT2hkVnRJMHgyNHhLU1lmNGF5RHcvYjBvajZsTWZGQ1V1MUZsczQ4S3JveFRQCk1JWFZuMUFPSW93cTdCNWwvb1RpTVRQWlEzdEpBS1loVnFmWk56SjczSXYyQS9QR3ZVYmZ4THpSOG5sZXc3Q3IKZTBsbHVqeDlFSmhnekxsRWZHbU9yQThjalZiQ0NJa0FiSnZJSkV5bTNVdHdkejh3SUcyWEcwS1pDN2xtc0dlegpyVk5oYlQ5cWtsNUZCVExzWXIxNkhGT1V3YTMvMFpYek5sNmhSSnVyek1yanJhSDVoVnBMQ0YzVDIwTjBHR1ZzClZDZG9IY2wzWDhjYTJWeUZLd1VnRlhEYTV2NzhqYXEyVnNMdThpOHlZVXFlVnQ3NE1HcW5zSzJEMFJWdk9tM3oKZXVPZ0dpajkwS01GNGZITDhEdUJJY2JkdHM3QStNUTYrKzRPSmE2cmdNbz08L1NpZ25hdHVyZVZhbHVlPgo8S2V5SW5mbz4KPFg1MDlEYXRhPgo8WDUwOUNlcnRpZmljYXRlPk1JSUdZVENDQkVtZ0F3SUJBZ0lKQU9qTmd0R1NVVGl5TUEwR0NTcUdTSWIzRFFFQkN3VUFNSUhHTVFzd0NRWUQKVlFRR0V3SlZVekVMTUFrR0ExVUVDQXdDUTBFeEZUQVRCZ05WQkFjTURFMXZkVzUwWVdsdVZtbGxkekVkTUJzRwpBMVVFQ2d3VVUzbHRZVzUwWldNZ1EyOXljRzl5WVhScGIyNHhJakFnQmdOVkJBc01HVUpESUMwZ1JXeGhjM1JwClkyRWdSVzVuYVc1bFpYSnBibWN4SVRBZkJnTlZCQU1NR0cxcFp5MWxiMlV1Wld4aGMzUnBZMkV0YVc1akxtTnYKYlRFdE1Dc0dDU3FHU0liM0RRRUpBUlllUkV3dFFrTXRkR1ZoYlMxa1pYWnZjSE5BYzNsdFlXNTBaV011WTI5dApNQjRYRFRFNU1EVXlNREl6TURZd01Gb1hEVEl4TURVeE9USXpNRFl3TUZvd2djWXhDekFKQmdOVkJBWVRBbFZUCk1Rc3dDUVlEVlFRSURBSkRRVEVWTUJNR0ExVUVCd3dNVFc5MWJuUmhhVzVXYVdWM01SMHdHd1lEVlFRS0RCUlQKZVcxaGJuUmxZeUJEYjNKd2IzSmhkR2x2YmpFaU1DQUdBMVVFQ3d3WlFrTWdMU0JGYkdGemRHbGpZU0JGYm1kcApibVZsY21sdVp6RWhNQjhHQTFVRUF3d1liV2xuTFdWdlpTNWxiR0Z6ZEdsallTMXBibU11WTI5dE1TMHdLd1lKCktvWklodmNOQVFrQkZoNUVUQzFDUXkxMFpXRnRMV1JsZG05d2MwQnplVzFoYm5SbFl5NWpiMjB3Z2dJaU1BMEcKQ1NxR1NJYjNEUUVCQVFVQUE0SUNEd0F3Z2dJS0FvSUNBUUNoa2FGcmN0ZzNsUFJhSjZVbW5SRTBnQ05EMisreAo3eHRWYzY2QUFjeVN1SXRKVGRLM0lZWG9QaXhtYThnRmxDdjJiNjNKK3B0YUdidWFuU1dNYWZpMnUyVko2OUlDCkkvMm9GVHFDcHM1U0t0Rk9DQXF6ai8xQks1dVl4WXo2VVFYYnNwWmVBb3lwTWZUbkRzYjJTTGRtcnk3Y01CaCsKZnFJQWtpZmpJVTlVN0FSaWlUaXBQdGxlaGNBQlVSWmpsVFRUamI1MXFyN3doeTU3ejB3N1pDNW03NzE2dzYrMApZZmZYbmVkUk1TQVpzNm8xRTNieHF6OENQdE01U1dYdXZ0L01iOWdHSm04MXkwMUJ1VGdwamZnK044TnI1Q2haCjJsNGtxUm5xc05XcXFpaUtEQXZRd25IYTFWYzBvZ2RIOG94bjU4d3Y5QXBpN3ZTelFrN28wRURKbWM3MlRiQnoKMXlFM0hNV0FrcVlUSmFYb284encxSVBHM2Y1WjJzbVlBV05aZHFjVWplcnNZR0RHYkczMXdUQzVyWkx0TjhNRQpOY3JMYlJKZTdYQTR4UXNOVEdITWVzbHF2SUpNdmlZODNmQVdLMkt5cTVacHBpakllV2p2a2h1YndGQnJwYmRaCmVaTjBqckh5TW81Nk5SWlFjbHAvVWlEVWRWeUNMRy9xSTQrSGZIbkIrUjc5Y3MxNFVWUVNBZG1wU1ZEeE5CMFAKUG1LWkFSUTFWWkd6SHQ3SDhwcVRjV2dqaTVIQkVoZUk3UWVIdU5yM0l0bnFXMXdGWitQQkg5RkFxVFlTUjdSVgp2OHZiZDBYc25BUjZwZnNOTTVURGZtdjg3WlJnUnBOQ3JVazdhdVMwUkxRUCsvUWZqeGNFWm52YkNjb002cGVICkJqRlJqaGpiME5nSHVRSURBUUFCbzFBd1RqQWRCZ05WSFE0RUZnUVUxN2VISVVLMG0vdVV2TEhmMGhBU2ovcEUKN3lNd0h3WURWUjBqQkJnd0ZvQVUxN2VISVVLMG0vdVV2TEhmMGhBU2ovcEU3eU13REFZRFZSMFRCQVV3QXdFQgovekFOQmdrcWhraUc5dzBCQVFzRkFBT0NBZ0VBbGNnUjFZb3RqNkdFcXZ1cWYxN0lGbGJ6d1pvU0dzb3RZRXR2CmRFMURwNmJ6Tk9ncGVRcEVtRVV1ZkZueHA1dXF6NktpbGNHb1NzV010dWhVNVlIREtQenNMNzRnS1IxQVJxeDEKTTkrMTM0OWRjMlRFaEl2b29Pb3JONG5XMEg3clVzMTk0OFpVNFFGQzM2bjZNckI0Q3pPem0wS2NuMU1hczVjeQp5REVtcFZWek5MMGZOT1V6RUlCNzg4bHdTN3hiMGMrOVlmcUFMVTlhdnQwcDlITjM3ZFN6SnFNa1lRNUVDMVQ1CklwMnhyVFVMVnJ1NHBGaVB6U2RrVnVOUzU2MHRKVFNJR1NZVmd1TTcyc2xZL2wwWC91bXhObEdobTVhMEN1USsKRnc2NmFPeWlFUFpGQ1U1U2ZtNzIrU2lGSkxmWUo1eWt5WWpwL2ZJb2I0aWtDb0RickhveXkzd29NQzdVQXZ1WApsbWhEWUloWXJGbW9Lb3dDR28xZnFMVlh1cVkycjdUT2xlQi81U3FJaHpBLzRXVHF6M1JYdzdLUWV0VDF6Qk9aCm03MElqTk9wTTJBVGJhOWttcEIzUk5YN3V3NXhBQ0J4RG9RakxCQXlOMDdxOC9WOUk2a0JsTFl5WXpzaEhzeEsKcUgzU09icmh1bGNzemlUaVBLYkpWT3ZZZGVIUlZ3Q3NEUkM1WkdUYlo2aE1BeWlhVFR4d25nOGtMNTU1dkxpRQpyOGNhK1ZUTExGY2xsdzZrQWVNS3JsRlZVODZYSDFuOWlPdUhOUjRKMEpTN3pZdFc2YUFFYkRHMG05RHB4S1dNCk84aG80OUJFWCtidEJqMkV0dFBFVEN5MWw5ZzM0dXQvTk83aVc0VE1rN0pVNjFTV3JWQURTNHJnZWN3TlFuMFkKWGdoc2xDVT08L1g1MDlDZXJ0aWZpY2F0ZT4KPC9YNTA5RGF0YT4KPC9LZXlJbmZvPgo8L1NpZ25hdHVyZT48c2FtbDI6U3ViamVjdCB4bWxuczpzYW1sMj0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmFzc2VydGlvbiI+PHNhbWwyOk5hbWVJRCBGb3JtYXQ9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDpuYW1laWQtZm9ybWF0OnBlcnNpc3RlbnQiPlA3Ui9pL3ViZzAyaUNDejZqa2lIL3c9PTwvc2FtbDI6TmFtZUlEPjxzYW1sMjpTdWJqZWN0Q29uZmlybWF0aW9uIE1ldGhvZD0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmNtOmJlYXJlciI+PHNhbWwyOlN1YmplY3RDb25maXJtYXRpb25EYXRhIEluUmVzcG9uc2VUbz0iX2RhNzliNmU5LTNhYjAtNGQzYy1iMjZkLWRkZTBhNTFhMmYzYyIgTm90T25PckFmdGVyPSIyMDE5LTA2LTIwVDIwOjAxOjAwLjA3OVoiIFJlY2lwaWVudD0iaHR0cHM6Ly9sb2dpbi5taWNyb3NvZnRvbmxpbmUuY29tL2xvZ2luLnNyZiIvPjwvc2FtbDI6U3ViamVjdENvbmZpcm1hdGlvbj48L3NhbWwyOlN1YmplY3Q+PHNhbWwyOkNvbmRpdGlvbnMgeG1sbnM6c2FtbDI9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDphc3NlcnRpb24iIE5vdEJlZm9yZT0iMjAxOS0wNi0yMFQxOTo1MTowMC4wNzlaIiBOb3RPbk9yQWZ0ZXI9IjIwMTktMDYtMjBUMjA6MDE6MDAuMDc5WiI+PHNhbWwyOkF1ZGllbmNlUmVzdHJpY3Rpb24+PHNhbWwyOkF1ZGllbmNlPmh0dHBzOi8vc2FtbC1wcm94eS5taWctZW9lLmVsYXN0aWNhLWluYy5jb20vc2FtbC9jYXNiX3JwX3NhbWxyZWFsbS85OGQ0NzBmN2MwNzE0ZDI4YmMyZTMyOTY3ZGJiOTc1Ml90cnllbGFzdGljYXJwZWRnZWNvbTwvc2FtbDI6QXVkaWVuY2U+PHNhbWwyOkF1ZGllbmNlPnVybjpmZWRlcmF0aW9uOk1pY3Jvc29mdE9ubGluZTwvc2FtbDI6QXVkaWVuY2U+PC9zYW1sMjpBdWRpZW5jZVJlc3RyaWN0aW9uPjwvc2FtbDI6Q29uZGl0aW9ucz48c2FtbDI6QXV0aG5TdGF0ZW1lbnQgeG1sbnM6c2FtbDI9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDphc3NlcnRpb24iIEF1dGhuSW5zdGFudD0iMjAxOS0wNi0yMFQxOTo1NjowMC4wNzhaIiBTZXNzaW9uSW5kZXg9Il9kYTc5YjZlOS0zYWIwLTRkM2MtYjI2ZC1kZGUwYTUxYTJmM2MiPjxzYW1sMjpBdXRobkNvbnRleHQ+PHNhbWwyOkF1dGhuQ29udGV4dENsYXNzUmVmPnVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDphYzpjbGFzc2VzOlBhc3N3b3JkUHJvdGVjdGVkVHJhbnNwb3J0PC9zYW1sMjpBdXRobkNvbnRleHRDbGFzc1JlZj48L3NhbWwyOkF1dGhuQ29udGV4dD48L3NhbWwyOkF1dGhuU3RhdGVtZW50PjxzYW1sMjpBdHRyaWJ1dGVTdGF0ZW1lbnQgeG1sbnM6c2FtbDI9InVybjpvYXNpczpuYW1lczp0YzpTQU1MOjIuMDphc3NlcnRpb24iPjxzYW1sMjpBdHRyaWJ1dGUgTmFtZT0ib2ZmaWNlMzY1LW5hbWVJRCIgTmFtZUZvcm1hdD0idXJuOm9hc2lzOm5hbWVzOnRjOlNBTUw6Mi4wOmF0dHJuYW1lLWZvcm1hdDp1bnNwZWNpZmllZCI+PHNhbWwyOkF0dHJpYnV0ZVZhbHVlIHhtbG5zOnhzPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxL1hNTFNjaGVtYSIgeG1sbnM6eHNpPSJodHRwOi8vd3d3LnczLm9yZy8yMDAxL1hNTFNjaGVtYS1pbnN0YW5jZSIgeHNpOnR5cGU9InhzOnN0cmluZyI+UDdSL2kvdWJnMDJpQ0N6NmpraUgvdz09PC9zYW1sMjpBdHRyaWJ1dGVWYWx1ZT48L3NhbWwyOkF0dHJpYnV0ZT48L3NhbWwyOkF0dHJpYnV0ZVN0YXRlbWVudD48L3NhbWwyOkFzc2VydGlvbj48L3NhbWwycDpSZXNwb25zZT4K
          - url: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060561945'
            method: OPTIONS
            label: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060561945'
            headers:
              Access-Control-Request-Method: POST
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Access-Control-Request-Headers: content-type
              Accept: '*/*'
          - url: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060561945'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060561945'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: application/json; charset=UTF-8
            body: '{"msgType":"MouseDown","mouseEvent":{"x":1262,"y":702,"relativeX":0.5231481481481481,"relativeY":0.6494140625,"width":108,"height":32,"shiftKey":false,"altKey":false,"ctrlKey":false,"button":"Left","fgId":"236","detail":1,"isRelative":true,"frameId":"0"},"tenantId":"","tabId":"acc7276167ea0630","isolationSessionId":"76f4e3b7-c906-49ec-8d4c-2133d01144ec"}'
          - url: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060561945'
            method: OPTIONS
            label: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060561945'
            headers:
              Access-Control-Request-Method: POST
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Access-Control-Request-Headers: content-type
              Accept: '*/*'
          - url: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060561945'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060561945'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: application/json; charset=UTF-8
            body: '{"msgType":"MouseUp","mouseEvent":{"x":1262,"y":702,"relativeX":0.5236205397201058,"relativeY":0.6524634002981693,"width":105.840087890625,"height":31.3599853515625,"shiftKey":false,"altKey":false,"ctrlKey":false,"button":"Left","fgId":"236","detail":1,"isRelative":true,"frameId":"0"},"tenantId":"","tabId":"acc7276167ea0630","isolationSessionId":"76f4e3b7-c906-49ec-8d4c-2133d01144ec"}'
          - url: 'https://isolate.mig-eoe.elastica-inc.com/embeddedurl/'
            method: GET
            label: 'https://isolate.mig-eoe.elastica-inc.com/embeddedurl/'
            think-time: 2376ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              url: 'https://www.office.com/?auth=2&home=1&from=PortalLanding&username=mig-test%40tryelasticarpedge.com&client-request-id=74ef09a2-b080-4108-911b-bedddb5218c7#fireglass_params|&tabid=acc7276167ea0630&start_with_session_counter=5&application_server_address=mig-qa.prod.fire.glass'
              fireglass_rsn: 'true'
          - url: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060571085'
            method: OPTIONS
            label: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060571085'
            headers:
              Access-Control-Request-Method: POST
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Access-Control-Request-Headers: content-type
              Accept: '*/*'
          - url: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060571085'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060571085'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: application/json; charset=UTF-8
            body: '{"msgType":"MouseDown","mouseEvent":{"x":712,"y":172,"relativeX":0.3443579766536965,"relativeY":0.7857740585774059,"width":32.125,"height":37.34375,"shiftKey":false,"altKey":false,"ctrlKey":false,"button":"Left","fgId":"590","detail":1,"isRelative":true,"frameId":"0"},"tenantId":"","tabId":"acc7276167ea0630","isolationSessionId":"74416428-45a1-4262-8a61-04d4901af6f4"}'
          - url: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060571085'
            method: OPTIONS
            label: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060571085'
            headers:
              Access-Control-Request-Method: POST
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Access-Control-Request-Headers: content-type
              Accept: '*/*'
          - url: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060571085'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=acc7276167ea0630&clientNetworkId=acc7276167ea06301561060571085'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: application/json; charset=UTF-8
            body: '{"msgType":"MouseUp","mouseEvent":{"x":712,"y":172,"relativeX":0.3443579766536965,"relativeY":0.7857740585774059,"width":32.125,"height":37.34375,"shiftKey":false,"altKey":false,"ctrlKey":false,"button":"Left","fgId":"590","detail":1,"isRelative":true,"frameId":"0"},"tenantId":"","tabId":"acc7276167ea0630","isolationSessionId":"74416428-45a1-4262-8a61-04d4901af6f4"}'
          - url: 'https://isolate.mig-eoe.elastica-inc.com/embeddedurl/'
            method: GET
            label: 'https://isolate.mig-eoe.elastica-inc.com/embeddedurl/'
            think-time: 972ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              url: 'https://tryelasticarpedge-my.sharepoint.com/_layouts/15/MySite.aspx?MySiteRedirect=AllDocuments&fireglass_rsn=true#fireglass_params|&tabid=ad3840f900d8a779&application_server_address=mig-qa.prod.fire.glass&popup=true&is_right_side_popup=false&start_with_session_counter=1&anti_bot_permission'
          - url: 'https://isolate.mig-eoe.elastica-inc.com/embeddedurl/'
            method: GET
            label: 'https://isolate.mig-eoe.elastica-inc.com/embeddedurl/'
            think-time: 1376ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
            body:
              url: 'https://tryelasticarpedge-my.sharepoint.com/personal/mig-test_tryelasticarpedge_com/_layouts/15/onedrive.aspx#fireglass_params|&tabid=ad3840f900d8a779&start_with_session_counter=2&application_server_address=mig-qa.prod.fire.glass'
              fireglass_rsn: 'true'
          - url: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            method: OPTIONS
            label: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            headers:
              Access-Control-Request-Method: POST
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Access-Control-Request-Headers: content-type
              Accept: '*/*'
          - url: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: application/json; charset=UTF-8
            body: '{"msgType":"MouseDown","mouseEvent":{"x":422,"y":77,"relativeX":0.20442708333333334,"relativeY":0.8125,"width":12,"height":16,"shiftKey":false,"altKey":false,"ctrlKey":false,"button":"Left","fgId":"25522","detail":1,"isRelative":true,"frameId":"0"},"tenantId":"","tabId":"ad3840f900d8a779","isolationSessionId":"da33aba5-7609-4c83-b46a-9ca09790857e"}'
          - url: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            method: OPTIONS
            label: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            headers:
              Access-Control-Request-Method: POST
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Access-Control-Request-Headers: content-type
              Accept: '*/*'
          - url: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: application/json; charset=UTF-8
            body: '{"msgType":"MouseUp","mouseEvent":{"x":422,"y":77,"relativeX":0.20442708333333334,"relativeY":0.8125,"width":12,"height":16,"shiftKey":false,"altKey":false,"ctrlKey":false,"button":"Left","fgId":"25522","detail":1,"isRelative":true,"frameId":"0"},"tenantId":"","tabId":"ad3840f900d8a779","isolationSessionId":"da33aba5-7609-4c83-b46a-9ca09790857e"}'
          - url: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/mouseDown?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: application/json; charset=UTF-8
            body: '{"msgType":"MouseDown","mouseEvent":{"x":396,"y":109,"relativeX":0.33173828125,"relativeY":0.375,"width":160,"height":32,"shiftKey":false,"altKey":false,"ctrlKey":false,"button":"Left","fgId":"28952","detail":1,"isRelative":true,"frameId":"0"},"tenantId":"","tabId":"ad3840f900d8a779","isolationSessionId":"da33aba5-7609-4c83-b46a-9ca09790857e"}'
          - url: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/mouseUp?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: application/json; charset=UTF-8
            body: '{"msgType":"MouseUp","mouseEvent":{"x":396,"y":109,"relativeX":0.33173828125,"relativeY":0.375,"width":160,"height":32,"shiftKey":false,"altKey":false,"ctrlKey":false,"button":"Left","fgId":"28952","detail":1,"isRelative":true,"frameId":"0"},"tenantId":"","tabId":"ad3840f900d8a779","isolationSessionId":"da33aba5-7609-4c83-b46a-9ca09790857e"}'
          - url: 'https://mig-qa.prod.fire.glass/upload/?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            method: OPTIONS
            label: 'https://mig-qa.prod.fire.glass/upload/?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            headers:
              Access-Control-Request-Method: POST
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Accept: '*/*'
          - url: 'https://mig-qa.prod.fire.glass/upload/?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            method: POST
            label: 'https://mig-qa.prod.fire.glass/upload/?tab_id=ad3840f900d8a779&clientNetworkId=ad3840f900d8a7791561060577795'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              Origin: 'https://isolate.mig-eoe.elastica-inc.com'
              Content-Type: multipart/form-data; boundary=----WebKitFormBoundaryZDJgBpQY0LDmBpbe
            body:
              "------WebKitFormBoundaryZDJgBpQY0LDmBpbe\r\nContent-Disposition: form-data; name": "\"relativePath\"\r\n\r\n\r\n------WebKitFormBoundaryZDJgBpQY0LDmBpbe\r\nContent-Disposition: form-data; name=\"files[]\"; filename=\"IMG_0592.jpg\"\r\nContent-Type: image/jpeg\r\n\r\n\r\n------WebKitFormBoundaryZDJgBpQY0LDmBpbe--\r\n"